app/Http/Controllers/HomeController.php

delete from `payments` where `id` = 6
---
        public function destroy($id)
        {
            $payment = Payment::find($id);
            $order_no = $payment->order_no;
            $payment->delete();