app/Http/Controllers/HomeController.php

    public function index(Request $request)
    {
        $payments = Payment::paginate(10);
        $shops = Shop::all();

        return view('home')->with(['payments' => $payments, 'shops' => $shops]);
---
select * from `payments` limit 10 offset 0
select count(*) as aggregate from `payments`
select * from `shops`

    public function filter(Request $request)
    {
        $payments = Payment::query();
        $shops = Shop::all();
---
select * from `shops`

        }

        // 自分が発行した伝票のみ表示する
        $self_issued_payments = $request->get('self_issued_payments') == 1;
---
select * from `payments`

        }


        return view('filter')->with(['payments' => $payments->get(), 'shops' => $shops, 'customer' => $filter_customer, 'order_no' => $filter_order_no, 'price' => $filter_price, 'self_issued_payments' => $filter_self_issued_payments]);
---
select * from `payments` where `customer` like '%a%'