app/Http/Controllers/ShopController.php

select * from `shops`
---
    public function index(Request $request)
    {
        $shops = Shop::query();

        $name = $request->get('name');
        if (!is_null($name)) {
            $shops->where('name', 'like', "%{$name}%");
        }

        $zipCode = $request->get('zip_code');
        if (!is_null($zipCode)) {
            $shops->where('zip_code', $zipCode);
        }


        return view('shops.index')->with('shops', $shops->get());

insert into `shops` (`name`, `zip_code`, `address1`, `address2`, `company_seal`, `updated_at`, `created_at`) values ('中村貴幸', '9850034', '7-17', '塩釜市南錦町', 'public/post_images/2019-06-13 01:03:09_10.jpg', '2019-06-13 01:03:09', '2019-06-13 01:03:09')
---
    public function create(Request $request)
    {
        $request->validate([
            'name' => 'required',
            'zip_code' => 'required|digits:7|integer' ,
            'address1' => 'required',
        ]);

        $shop= new Shop();
        $shop->name= $request['name'];
        $shop->zip_code= $request['zip_code'];
        $shop->address1= $request['address1'];
        $shop->address2= $request['address2'];
        $shop->save();

select * from `shops`
---
    public function edit($id)
    {
        $shop = Shop::find($id);
        $shops = Shop::all();

delete from `shops` where `id` = 1
---
    public function destroy(Shop $shop, $id)
    {
//        dd($shop::find('1')->toArray());
        $shop::find($id)->delete();