app/Http/Controllers/UserController.php

    public function index(Request $request)
    {
        $users = User::paginate(10);

        return view('users.index')->with('users', $users);
---
select * from `users`

    public function filter(Request $request)
    {
        $users = User::query();
        $name = $request->get('name');
        if (!is_null($name)) {
            $users->where('name', 'like', "%{$name}%");
        }
        $request->flash();
        return view('users.filter')->with('users', $users->get());
---
select * from `users` where `name` like '%t%'